DataReptile/DataReptile.DataImport/DataReptile.DataImport/bin/Debug/Resource/Template/register_req.txt

<#--这个模板用于以下情况
  --1、新增预约 (包括添加常用挂号人)
  --2、取消预约
  --3、修改预约（包括专家评分）
  --4、修改用户信息
  --5、删除常用挂号人
-->
<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <RegisterReq xmlns="http://new.webservice.namespace">
            <AuthInfo>
                <UserName>${vendorName}</UserName>
                <Password>${vendorPass}</Password>
            </AuthInfo>
            <OperType>${operType}</OperType>
            <SN>${sn?if_exists}</SN>
            <PatientInfo>
                <IdCard>${idCard}</IdCard>
                <Name>${name}</Name>
            <#--phone核心平台没有强制要求，第三方强制要求，为了发短信和校验是否匹配-->
                <Phone>${phone?if_exists}</Phone>
            <#--Sex/Birth核心平台，不验证，第三方也没有必要强制用户输入，不填
                <Sex></Sex>
                <Birth></Birth>-->
                <InsureType>${insureType?if_exists}</InsureType>
                <PayAccount>${payAccount?if_exists}</PayAccount>
            <#-- <IdCard>${patient.ownerIdCard?if_exists}</IdCard> -->
            </PatientInfo>
            <RegInfo>
                <HospName>${hospitalName?if_exists}</HospName>
                <DepartName>${departName?if_exists}</DepartName>
                <DoctorName>${doctorName?if_exists}</DoctorName>
                <DocRate>${docRate?if_exists}</DocRate>
                <WorkDate>${workDate?if_exists}</WorkDate>
                <WorkType>${workType?if_exists}</WorkType>
                <StartTime>${startTime?if_exists}</StartTime>
                <EndTime>${endTime?if_exists}</EndTime>
                <RegOperType>
                    <RadCheckType>${radCheckType?if_exists}</RadCheckType>
                    <BodyCheckSet>${bodyCheckSet?if_exists}</BodyCheckSet>
                </RegOperType>
            </RegInfo>
            <RegFrom>
                <RegVia>${regVia}</RegVia>
                <Vendor>${vendor}</Vendor>
                <Operator>${operator}</Operator>
            </RegFrom>
        </RegisterReq>
    </S:Body>
</S:Envelope>