DataReptile/DataReptile.DataImport/DataReptile.DataImport/bin/Debug/Resource/Template/getReg_req.txt

<#--模板使用以下情况
  --1、查询预约记录
-->
<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <GetRegInfoReq xmlns="http://new.webservice.namespace">
            <AuthInfo>
                <UserName>${vendorName}</UserName>
                <Password>${vendorPass}</Password>
            </AuthInfo>
            <PatientIdentify>
                <SN>${sn?if_exists}</SN>
                <IdCard>${idCard}</IdCard>
                <Other>
                    <Name>${name?if_exists}</Name>
                    <Phone>${phone?if_exists}</Phone>
                </Other>
            </PatientIdentify>
            <Filter>
                <BeginDate>${beginDate?if_exists}</BeginDate>
                <EndDate>${endDate?if_exists}</EndDate>
                <HospName>${hospName?if_exists}</HospName>
                <DepartName>${departName?if_exists}</DepartName>
                <DoctorName>${doctorName?if_exists}</DoctorName>
            </Filter>
        </GetRegInfoReq>
    </S:Body>
</S:Envelope>